Revit 2027 API
FilledRegion.SetLineStyleId Method
 Sets the line style Id for all boundaries.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLineStyleId(
	ElementId lineStyleId
)
Public Sub SetLineStyleId (
	lineStyleId As ElementId
)
public:
void SetLineStyleId(
	ElementId^ lineStyleId
)
member SetLineStyleId :
        lineStyleId : ElementId -> unit
Parameters
lineStyleId ElementId
 The line style Id.
Exceptions
Exception | Condition
ArgumentException |  lineStyleId is not a valid line style Id for a filled region.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilledRegion Class
Autodesk.Revit.DB Namespace